incompressibleVoF/DTCHull/Allmesh
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Copy DTC hull surface from resources folder
cp $FOAM_TUTORIALS/resources/geometry/DTC-scaled.stl.gz constant/geometry/

runApplication surfaceFeatures

runApplication blockMesh

for i in 1 2 3 4 5 6
do
    runApplication -a foamDictionary system/refineMeshDict -entry set -set c${i}

    runApplication -a topoSet

    runApplication -a refineMesh -dict refineMeshDict -overwrite
done

rm -rf constant/polyMesh/sets

runApplication snappyHexMesh -overwrite

runApplication renumberMesh -noFields -overwrite

#------------------------------------------------------------------------------
